pmo-dataset/graphviz/49.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "StartNoneEvent" -> "Customer brings a\ndefective computer";
  "Customer brings a\ndefective computer" -> "CRS checks the\ndefect";
  "CRS checks the\ndefect" -> "CRS hands out a\nrepair cost\ncalculation";
  "CRS hands out a\nrepair cost\ncalculation" -> "ExclusiveGateway_1";
  "ParallelGateway_1" -> "Check the hardware";
  "ParallelGateway_1" -> "Check the software";
  "Repair is finished" -> "ExclusiveGateway_4";
  "Check the hardware" -> "Repair the hardware";
  "Proper system\nfunctionality is\ntested" -> "ExclusiveGateway_2";
  "Check the software" -> "Configure the\nsoftware";
  "ParallelGateway_2" -> "Proper system\nfunctionality is\ntested";
  "ExclusiveGateway_3" -> "ParallelGateway_1";
  "Repair the hardware" -> "ParallelGateway_2";
  "Configure the\nsoftware" -> "ParallelGateway_2";
  "ExclusiveGateway_4" -> "EndNoneEvent";
  "Client takes her\ncomputer home\nunrepaired" -> "ExclusiveGateway_4";
  "ExclusiveGateway_1" -> "Client takes her\ncomputer home\nunrepaired" [label="costs are not\nacceptable"];
  "ExclusiveGateway_1" -> "ExclusiveGateway_3" [label="costs are acceptable"];
  "ExclusiveGateway_2" -> "ExclusiveGateway_3" [label="error is detected"];
  "ExclusiveGateway_2" -> "Repair is finished" [label="no error"];

  "StartNoneEvent" [label="", shape=circle];
  "EndNoneEvent" [label="", shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
