pmo-dataset/mermaid/49.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	StartNoneEvent_1((" ")) --> Task_1["Customer brings a\ndefective computer"]
	Task_1 --> Task_2["CRS checks the\ndefect"]
	Task_2 --> Task_3["CRS hands out a\nrepair cost\ncalculation"]
	Task_3 --> ExclusiveGateway_1{"X"}
	ParallelGateway_1{"+"} --> Task_5["Check the hardware"]
	ParallelGateway_1 --> Task_6["Check the software"]
	Task_8["Repair is finished"] --> ExclusiveGateway_4{"X"}
	Task_5 --> Task_9["Repair the hardware"]
	Task_7["Proper system\nfunctionality is\ntested"] --> ExclusiveGateway_2{"X"}
	Task_6 --> Task_10["Configure the\nsoftware"]
	ParallelGateway_2{"+"} --> Task_7
	ExclusiveGateway_3{"X"} --> ParallelGateway_1
	Task_9 --> ParallelGateway_2
	Task_10 --> ParallelGateway_2
	ExclusiveGateway_4 --> EndNoneEvent_1((" ")):::endEvent
	Task_4["Client takes her\ncomputer home\nunrepaired"] --> ExclusiveGateway_4
	ExclusiveGateway_1 -->|"costs are not\nacceptable"| Task_4
	ExclusiveGateway_1 -->|"costs are acceptable"| ExclusiveGateway_3
	ExclusiveGateway_2 -->|"error is detected"| ExclusiveGateway_3
	ExclusiveGateway_2 -->|"no error"| Task_8
